; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph1 - mode
	spectrograph3 - mode
	infrared2 - mode
	infrared0 - mode
	thermograph4 - mode
	GroundStation1 - direction
	GroundStation5 - direction
	Star6 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star7 - direction
	Star4 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star7)
	(supports instrument4 spectrograph3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument5 spectrograph3)
	(supports instrument5 thermograph4)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument7 thermograph1)
	(supports instrument7 thermograph4)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star7)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(pointing satellite3 GroundStation0)
	(have_image Star8 infrared2)
	(have_image Star9 infrared2)
	(have_image Star10 infrared2)
	(have_image Planet11 infrared2)
	(have_image Star12 thermograph1)
	(have_image Phenomenon13 thermograph4)
	(have_image Phenomenon14 thermograph4)
))

)

; plan
1. (turn_to satellite3 star7 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star7)
   goals met: 0 of 8
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 8
3. (calibrate satellite3 instrument7 star7)
   added: (calibrated instrument7)
   goals met: 0 of 8
4. (turn_to satellite3 star12 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star12)
   goals met: 0 of 8
5. (take_image satellite3 star12 instrument7 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite3 groundstation0 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 groundstation0)
   goals met: 2 of 8
7. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   goals met: 2 of 8
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 8
9. (calibrate satellite0 instrument1 star7)
   added: (calibrated instrument1)
   goals met: 2 of 8
10. (turn_to satellite0 phenomenon13 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 8
11. (take_image satellite0 phenomenon13 instrument1 thermograph4)
   added: (have_image phenomenon13 thermograph4)
   goals met: 3 of 8
12. (turn_to satellite0 phenomenon14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 8
13. (take_image satellite0 phenomenon14 instrument1 thermograph4)
   added: (have_image phenomenon14 thermograph4)
   goals met: 4 of 8
14. (turn_to satellite0 planet11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet11)
   goals met: 4 of 8
15. (take_image satellite0 planet11 instrument1 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 5 of 8
16. (turn_to satellite0 star10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star10)
   goals met: 5 of 8
17. (take_image satellite0 star10 instrument1 infrared2)
   added: (have_image star10 infrared2)
   goals met: 6 of 8
18. (turn_to satellite0 star8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star8)
   goals met: 6 of 8
19. (take_image satellite0 star8 instrument1 infrared2)
   added: (have_image star8 infrared2)
   goals met: 7 of 8
20. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 7 of 8
21. (take_image satellite0 star9 instrument1 infrared2)
   added: (have_image star9 infrared2)
   goals met: 8 of 8
